[
    {
        "references": "Among the sources of inspiration for the enormous Mama the Hutt was Pearl, the obese vampire in Blade (1998).",
        "source": "f69bc65d-d813-4a81-b023-8844e552b06e",
        "id": "c9216a40-c159-4347-869e-1ee35aa328ce"
    },
    {
        "references": "The small hovering droids in Mama's house -- the Ran-D Housekeeper droids -- are an homage to the tiny robots built by ILM in \"Batteries not included\" (1987).",
        "source": "f69bc65d-d813-4a81-b023-8844e552b06e",
        "id": "2acafe9e-4666-4926-95a6-4a3e42a31d5e"
    },
    {
        "references": "The dance number in the episode was inspired by the opening scene of Indiana Jones and the Temple of Doom (1984), where Willie Scott and troupe of chorus girls entertain gangster Lao Che and his henchmen.",
        "source": "f69bc65d-d813-4a81-b023-8844e552b06e",
        "id": "1bf9510c-620a-41f7-a0df-b574756a6e09"
    },
    {
        "references": "If you listen closely when Ziro dies, he mutters \"What a World, what a world!\", a nod to the death of the Wicked Witch in The Wizard of Oz (1939).",
        "source": "f69bc65d-d813-4a81-b023-8844e552b06e",
        "id": "c5c180b7-0db2-4a87-a785-3fe17b057380"
    },
    {
        "references": "In one version of the script, Mas Amedda was in the executive office with Chancellor Palpatine. In the final, it is Orn Free Taa, taking advantage of his pre-existing character model.",
        "source": "a7072583-01ad-4996-8c93-44dd6bbe28d1",
        "id": "da07d553-6a84-48de-a51f-6140408a9cec"
    },
    {
        "references": "Among the inspirations for the tone and pacing of the droid spa sequence was the scene where Steve Zissou gives the audience a tour of his boat in Wes Anderson's The Life Aquatic.",
        "source": "a0efe45e-e0e6-4b62-9bc8-37318395fad3",
        "id": "7778fb13-36f8-42f7-a040-d91af5efd85e"
    },
    {
        "references": "The baker droid is voiced by Duff Goldman from the TV show \"Ace of Cakes\"; the Food Network show had previously based an entire episode on creating an R2-D2 cake for the CLone Wars season two wrap party.",
        "source": "a0efe45e-e0e6-4b62-9bc8-37318395fad3",
        "id": "363bd92a-2143-4bbd-a28a-5b3ac931fab7"
    },
    {
        "references": "The Droid that yells \"Murderer!\" at Todo and the assassin droid was voiced by Matt Lanter, the voice of ANakin Skywalker.",
        "source": "a0efe45e-e0e6-4b62-9bc8-37318395fad3",
        "id": "67049091-a5d6-4c65-983d-cc164b741d60"
    },
    {
        "references": "Todo 360's ironic farewell of \"thanks for the memories\" is a nod to the 1938 hit song of the same name made famous in The Big Broadcast of 1938 and as actor-comedian Bob Hope's signature song.",
        "source": "a0efe45e-e0e6-4b62-9bc8-37318395fad3",
        "id": "606f887d-3aa3-49d5-9b78-8c40f396157f"
    },
    {
        "references": "Earlier versions of the story had patrons in Aunt Z's bar betting on the outcome of the training missions, with Neeku and Wiles involved.",
        "source": "d9abd431-06dd-436d-af01-3c2450a9ae4f",
        "id": "d6e0da09-fc44-4305-84c9-1d7d042ba02c"
    },
    {
        "references": "At one point, the episode was to feature Kaz and the pirate salvagers fighting a squad of First Order sentry droids aboard the wreckage of the Dreadnought.",
        "source": "61091aab-1f26-49ef-9a33-b85ea6d7a80c",
        "id": "6aeeca41-0aa7-4d3c-a58f-d66679800e9b"
    },
    {
        "references": "An extra obstacle of the coaxium cartridge not fitting into the Colossus' fuel chamber was cut to save time in the fast-paced third act.",
        "source": "61091aab-1f26-49ef-9a33-b85ea6d7a80c",
        "id": "1ddbd079-b23d-474d-8ae8-f43e88b2c40b"
    },
    {
        "references": "In the earliest outlines, this episode originally began in the marketplace, with Kaz weathering all sorts of complains from concerned citizens who blamed him for the platform's current predicament. Later drafts started with Bucket and CB watching the hyperspace tunnel. It wasn't until the final edit that the First Order introductory scene - originally slated for later in the episode - was moved to the start.",
        "source": "c81b24ac-9eef-496c-a046-fe17609f1d80",
        "id": "1b675999-84c3-47e3-b67d-3dced3fadb60"
    },
    {
        "references": "An early version of the episode had a free-floating Kaz bump into Bolza, who was trying to collect a bunch of wayward gorgs. In the Final episode, it's Opeepit that Kaz knocks in mid-air.",
        "source": "c81b24ac-9eef-496c-a046-fe17609f1d80",
        "id": "adeedb9f-6cd3-4a59-bc01-7bf169efff86"
    },
    {
        "references": "In the script and in an early cut of the episode, there was another corridor-flooding sequence with Kaz jumping into a doorway with Garma, the old Arcona lady. After Kaz tackles her to get her out of hte way of the crashing waves, seh would have pinched his cheek and called him \"an adventurous one.\".",
        "source": "0996211c-e3b3-4580-8593-bf12a7b12b12",
        "id": "058416a4-46ae-436e-9926-dfb06209faf1"
    },
    {
        "references": "In the early cut of the episode, Aunt Z's arrival was unheralded at the end, but to better set up her return, a scene was added with Neeku receiving a signal from her.",
        "source": "0996211c-e3b3-4580-8593-bf12a7b12b12",
        "id": "54c70941-aa80-4bc3-a0b1-83c25194baf3"
    },
    {
        "references": "When Captain Doza frees the imprisoned Aces, an earlier cut of the scene had Freya sharing a cell with Griff, who was working out by doing pull ups. Freya is thankful for the save, saying, \"Do you know what it's like to be stuck in a cell with Griff for three days?\"",
        "source": "0996211c-e3b3-4580-8593-bf12a7b12b12",
        "id": "a79380d5-9866-4742-9a97-bc6d7dcb0f42"
    },
    {
        "references": "The original outline of the episode did not include Agent Tierny, but rather left the task of arresting and questioning Tam to Commander Pyre. In the first draft of the script, Pyre was replaced by an Admiral Tierny. By the second draft, she was redefined as a security agent.",
        "source": "b1a96a8e-64a8-427d-964e-4598e73e2a10",
        "id": "ac206e70-4a53-4d5f-84ef-c62fc25551f3"
    },
    {
        "references": "Originally the episode was to end with the pirates intercepting Kaz's message, with that scene coming after Kaz's resolve to free the Colossus. These were flipped in editorial, to end on Kaz's more determined vow.",
        "source": "b1a96a8e-64a8-427d-964e-4598e73e2a10",
        "id": "8909e646-4b4e-4719-9adf-2c0adc3f5632"
    },
    {
        "references": "Chairman Papanoida is based on George Lucas' cameo appearance in the opera house scene in Star Wars: Episode III Revenge of the Sith. Papanoida's family members are based on Lucas' children. Given the amount of dialogue delivered by Papanoida, voice actor Corey Burton plays the role, who gives a nod to the character's roots by basing his voice on another famous director, Orson Welles.",
        "source": "dc2af3e8-b6f0-4bdb-9f3c-7f4f7700f29c",
        "id": "27711ae9-8ab9-4237-b682-1959ad95039b"
    },
    {
        "references": "Chi Eekway Papanoida is based on Katie Lucas, the writer of the episode, who also appeared in Episode III as the Senator of Pantora. Hasbro previously released a Chi Eekway action figure, and incorrectly speculated that the blue-skinned Senator might have Twi'lek head-tails under her heavy robes. Katie also appeared as a purple Twi'lek nightclub patron in Episode II, and Anakin's friend Amee in Episode 1.",
        "source": "dc2af3e8-b6f0-4bdb-9f3c-7f4f7700f29c",
        "id": "ae7bcef3-ff74-4c7b-8b09-b1e09d1c7979"
    },
    {
        "references": "Che Amanwe Papanoida is based on Amanda Lucas. She has previously appeared in the live action movies as Senator Terr Taneel (in Episode III), a nightclub patron named in Episode II, the voice of Neimoidian pilot Tey How in Episode I, and a spectator in Jabba the Hutt's box at the Podrace arena.",
        "source": "dc2af3e8-b6f0-4bdb-9f3c-7f4f7700f29c",
        "id": "ca86833f-362a-4b06-8472-8bb613eeb76e"
    },
    {
        "references": "Ion Papanoida is based on Jett Lucas. Jett's name was the inspiration for Dexter Jettster in Episode II. Jet has previously appeared in the live action movies as Zett Jukassa in Episodes II and III.",
        "source": "dc2af3e8-b6f0-4bdb-9f3c-7f4f7700f29c",
        "id": "0f6046b0-a279-42d6-aed1-01179bb262c3"
    },
    {
        "references": "Kaz tends to think with his stomach. This is the second time he's grasped for straws while lying to Synara by talking about food. The first: trying to explain a targeting computer component was a food steamer in \"Synara's score\".",
        "source": "66d89e70-51e1-4cd2-b495-b6ac1a351f8a",
        "id": "d77dbde8-24f3-4d63-8df5-5f3cdce3014b"
    },
    {
        "references": "The Colossus identification badge design is based on the ID badges worn by employees at the Letterman Digital Arts Center, where Lucasfilm Animation is based.",
        "source": "66d89e70-51e1-4cd2-b495-b6ac1a351f8a",
        "id": "53f2768f-2a44-43b9-8bb1-ee0534a8349e"
    },
    {
        "references": "The first act originally ended with the scene of the stormtroopers in Yeager's garage, but this was moved earlier in the edit, in part to keep the drama focused on Synara's story.",
        "source": "66d89e70-51e1-4cd2-b495-b6ac1a351f8a",
        "id": "9320a7a7-7dc5-4e11-8952-09a10012633b"
    },
    {
        "references": "The shot of Synara's pod launching is a visual nod to the launch of the escape pod in Star Wars: A New Hope, which was one of the very first shots ever completed by Industrial Light & Magic.",
        "source": "66d89e70-51e1-4cd2-b495-b6ac1a351f8a",
        "id": "77c7d876-c79b-4028-b2c8-f29946f80f4e"
    },
    {
        "references": "The original outline for the episode had Flix and Orca leaving the platform to deal with \"a major shipment problem.\" It then changed to leaving to \"seal the biggest deal of the year.\" By the second draft of the script, this had been changed once again to visiting Flix's mother.",
        "source": "cd2a9667-84e8-49a3-a386-f53d4d7faff7",
        "id": "46526e84-4c13-4482-b8e7-d1986227b427"
    },
    {
        "references": "In an earlier version of the script, Yeager's crew was working on Bo Keevil's racer. Artwork showing the interior engine sections of the Yellow Ace ship was developed to that end, but the final draft of the script changed it to the Fireball.",
        "source": "cd2a9667-84e8-49a3-a386-f53d4d7faff7",
        "id": "bb332fd1-d1aa-4631-b01a-b687d2b8e99d"
    },
    {
        "references": "The design of the aiwhas -- or flying whales -- dates back to the production of The Empire Strikes Back. Concept illustrator Ralph McQuarrie first drew flying whale-like creatures to inhabit the clouds of Bespin. Abandoned for Episode V, they were stetched as possible creatures in Return of the Jedi and then as a concept mount for the Gungans of Naboo in Episode I. They were finally shown on screen as creatures found in Kamino's oceans in Star Wars: Episode II Attack of the Clones in 2002.",
        "source": "e39c4fa3-76ca-4e1f-8bb9-199192f55993",
        "id": "df96b9e6-d36e-4875-9072-5fbe6b74222a"
    },
    {
        "references": "At one point in early story development, Ahsoka visited Boba Fett in jail to ask for details about Aurra Sing.",
        "source": "0ef0cec0-f83a-4845-9494-0b7060a3b3cd",
        "id": "c8d56088-1366-4feb-9657-d24fcfbad4b8"
    },
    {
        "references": "Greg Proops returns to Star Wars to voice a race announcer, but it's not the two-headed announcer from Star Wars: The Phantom Menace's podrace. Although the voice is the same, it's more akin to a copycat invoking a classic announcer style.",
        "source": "c6eed3ff-e9de-4201-8aa3-0cb6f9605d40",
        "id": "a6f783f1-1238-4f23-b0d2-6d36045d3c63"
    },
    {
        "references": "Script original: Les clones utilisaient des Battle Droids pour combattre le Battle Droids. Idée rejetée car trop de confusion.",
        "source": "3514b5de-30d6-4856-a8e3-bc6dbd6a7882",
        "id": "949eaba2-0d63-45ad-9c86-73e813ce63bc"
    },
    {
        "references": "In the earliest outline of this episode, the young racers that Kaz meets had the placeholder names Camie, Fixer, and Deak. These were the names of Luke Skywalker's teenage friends at Tosche Station in the original Star Wars, featured in scenes eventually cut from the film.",
        "source": "f8a51c17-721f-4f9a-9ff3-06cfebf514ad",
        "id": "32264f8f-f778-4f3b-bda2-152549e2c250"
    },
    {
        "references": "The design of Rucklin's speeder bike is based on early Return of the Jedi concept art by Nilo Rodis-Jamero.",
        "source": "f8a51c17-721f-4f9a-9ff3-06cfebf514ad",
        "id": "78aa0d76-bbcd-4b01-8770-6b41387d9c5b"
    },
    {
        "references": "Scenes cut prior to animation would have had Kaz and Neeku asking around Acquisitions to see if Flix and Orka knew anything about missing children, and then to the Admissions office, before running into Kel and Eila in the marketplace.",
        "source": "c1c33a5e-f7fe-436e-be2b-8b084064f20b",
        "id": "cd78d36c-77ab-4f07-89dc-194c2ea01f1c"
    },
    {
        "references": "In earlier versions of their characters, Kel and Elia were named \"Bo\" and \"Dopa\", which is \"one\" and \"two\" in huttese.",
        "source": "c1c33a5e-f7fe-436e-be2b-8b084064f20b",
        "id": "d0a4b335-d445-43b7-a164-b6d6d676e7f2"
    },
    {
        "references": "In the original outline to the episode, Yeager was to take Kaz to a nearby atoll, where Poe and CB-23 had landed their X-Wings. But in the True spirit of \"faster, more intense\" Star Wars action, this was restaged to the mid-air transfer to keep the episode moving.",
        "source": "331ba989-3285-4065-84dc-6510e427f6c3",
        "id": "e6ae6d02-ac11-46c1-92e4-7aee8317802c"
    },
    {
        "references": "In early stages, Poe's loaner droid was named BB-23, but having two droids named BB would be confusing, so she was renamed CB-23 -- which ends up being a nod to Carrie Beck, vice president of development within the Lucasfilm Story Group.",
        "source": "331ba989-3285-4065-84dc-6510e427f6c3",
        "id": "4d6fb944-3d86-4359-aae7-3ade07d7cffa"
    },
    {
        "references": "Earlier designs of Synara included studies of her as a Weequay, as well as a green-skinned Mirialan.",
        "source": "331ba989-3285-4065-84dc-6510e427f6c3",
        "id": "9fd6f595-49b2-4c63-a2f0-c13c39bfd589"
    },
    {
        "references": "Au départ, c'était supposé être Han Solo qui vienne courser, mais a été changé en Marcus Speedster pour approfondir le personnage de Yeager.",
        "source": "038a3d53-84ac-4ff2-8b2e-5c3aa3527fb0",
        "id": "63e0ca10-c4dd-428a-a7fe-bd41ac4bf797"
    },
    {
        "references": "Buggles is based on a design developed by Terryl Whitlatch, a concept artist on The Phantom Menace. She illustrated a creature called a voorpak, an eight-legged furball pet favored by Naboo aristocracy. Buggles may be a designer breed, as he is six-legged, not eight.",
        "source": "515d82e2-38c8-408f-97f4-897367fc584f",
        "id": "365be020-c4a3-4914-81b4-3b39a0a92d9d"
    },
    {
        "references": "4D-M1N's name is based on the \"leet\" alphanumeric spelling of \"ADMIN\".",
        "source": "515d82e2-38c8-408f-97f4-897367fc584f",
        "id": "aa392271-d041-41a7-b71e-34d6787af827"
    },
    {
        "references": "When Poe uses his scanner to search for any life-sign readings of Kaz in the asteroid debris, his instruments make the same sound that the snowpeeder looking for Luke Skywalker and Han Solo after a Hoth blizzard make in The Empire Stirkes Back.",
        "source": "15e7c9ad-8876-4430-8925-3cfefeeda3d5",
        "id": "1ab3c7c7-ee57-477e-8009-e1a18d323a7f"
    },
    {
        "references": "Similaire à l'épisode \"The Box\" de Clone Wars. S'appelle ici \"The Well\".",
        "source": "e9d7195b-bbe4-49c0-afb9-7d7bf8d4a35f",
        "id": "83db56ad-5e0b-4da0-808f-caf4ce8af3e0"
    },
    {
        "references": "The early outline also included a role for Governor Pryce, who is spoken about but not yet seen in the series. It was Pryce who was to be sacrificed by Vader in a shuttle explosion, and Minister Tua would have then been promoted to governor.",
        "source": "4fa1fa6a-86bc-4ecc-b3bf-5c7d04f8fc18",
        "id": "fea4619b-1112-4563-afc2-12022a6d3ed1"
    },
    {
        "references": "An earlier version of this story had Morad Sumar in it. He would describe to Ezra the conditions on Lothal and be particularly shocked when word reached the populace that Ezra was part of the crew that killed Minister Tua.",
        "source": "4fa1fa6a-86bc-4ecc-b3bf-5c7d04f8fc18",
        "id": "27f4187c-73ed-496c-bd7b-1cfd1787eefd"
    },
    {
        "references": "The Kwazel Maw design is based on unused Ralph McQuarrie design for a swamp slug creature on Dagobah.",
        "source": "b6d7e684-be78-4b5f-86f6-4b4cf9e31a22",
        "id": "920d6f70-19da-4040-a78b-a464e3487092"
    },
    {
        "references": "Le Jomba fait le bruit du Sarlacc. Aussi Bruit de Podrace.",
        "source": "a61ec8b3-fb84-4c41-8185-510ae9eeb5f7",
        "id": "d5761f69-18b1-4bd8-8a01-2994049ee85b"
    },
    {
        "references": "The joopa fishing sequence is an extended homage to the 1975 movie Jaws.",
        "source": "a61ec8b3-fb84-4c41-8185-510ae9eeb5f7",
        "id": "bd17ef99-fbf3-4aac-ae92-13f8943a224c"
    },
    {
        "references": "In the original script, the ship that Anakin and Obi-Wan discover in the hangar bay was a Sabaoth starfighter, a vessel from the 2002 Star Wars: Jedi Starfighter videogame.",
        "source": "30b75765-0260-4bd6-9e81-9c02b1195c6d",
        "id": "d1149672-10a0-4e6f-8f73-2c811d1872ed"
    },
    {
        "references": "Originally, there were going to be two Kowakian monkey lizards as part of the pirate group -- twin brother Pikk and Pilf Mukmuk, but their role was consolidated into Pilf'",
        "source": "30b75765-0260-4bd6-9e81-9c02b1195c6d",
        "id": "fbbb0ffb-c6d5-40ae-a86d-67ed4e6d86eb"
    },
    {
        "references": "The original script had the evidence of plague be at the very start of the episode, moving downstream and affecting an entire Gungan Village. Some remnants of this order of events remain in the finished episode. Notably, the tense relationship with the Gungans that Padmé cites stems from this version of the story.",
        "source": "29781f68-e1b2-4932-92cf-e98f44a37200",
        "id": "871d2b39-51ef-4c3c-aa0b-9e99207d65ec"
    },
    {
        "references": "The script originally called for the tactical droid to be a tripedal medical droid. This is why C-3PO says to it, \"we all want to hear your tale of medical heroics.\"",
        "source": "29781f68-e1b2-4932-92cf-e98f44a37200",
        "id": "110784da-f602-4c19-b231-131a9081304e"
    },
    {
        "references": "Originally, the \"rabbit\" droid took the bomb and left in Act II never to be seen again. Padmé found the missing bomb in the greenhouse room, left behind for no apparent reason. The addition of the scampering droid with the bomb was done during editorial, not only for story logic but to add the fun beat where it startles Padmé.",
        "source": "29781f68-e1b2-4932-92cf-e98f44a37200",
        "id": "7f365aaa-0ee1-4628-956a-687d70fddca0"
    },
    {
        "references": "In the script, the plants in the greenhouse room where Padmé finds the missing bomb were originally \"tea Leaf plants.\" In the end, Giancarlo Volpi and Dave Filoni decided it was better if the plants seemed more like they were involved in the creation of the Blue Shadow VIrus somehow, hence their blue color",
        "source": "29781f68-e1b2-4932-92cf-e98f44a37200",
        "id": "e7034bbd-0fa8-417d-b882-19c881ea87f2"
    },
    {
        "references": "Originally, the xandu was to have been devoured by the reeksa vines.",
        "source": "7635f98c-b49d-4942-bbb7-6cd797c6b75e",
        "id": "1723c7de-3ae3-4670-8d27-96a8d5e6678e"
    },
    {
        "references": "Originally, Mar Tuuk was to have died aboard his ship, but he proved interesting enough to George Lucas and The Clone Wars crew that his life was spared. A new scene of him leaving the bridge was added late in the making of the episode, and a line of dialogue was given to a battle droid explaining that Mar Tuuk fled in an escape pod.",
        "source": "57530b12-fb32-4bfa-b019-8d782f19bd13",
        "id": "dbcd6061-c36f-41f1-914b-c2ff01591bcf"
    },
    {
        "references": "The original script for the episode describes Mace Windu using his lightsaber to cut open the fallen walker's canopy. In the final episode, he uses the Force to shatter the glass instead, consistent with his expanded universe talent for finding and exploiting shatterpoints.",
        "source": "36604467-d1dd-413d-a56e-179b4667266e",
        "id": "770cecc4-0103-4206-87c6-591b0a6cc51e"
    },
    {
        "references": "An earlier version of the story had Mace rescuing captive Twi'leks from a prison suspended over the caldera of a volcano, however the production paintings of such an apocalyptic setting ended up looking too similar to Mustufar.",
        "source": "36604467-d1dd-413d-a56e-179b4667266e",
        "id": "5beafabd-ff9a-4a3f-b724-a8b443e1cb28"
    },
    {
        "references": "Hommage à 2 scènes impériales de l'Empire contre-attaque",
        "source": "07a82a51-3580-4a7e-b909-f0737684465c",
        "id": "27c5f35e-534b-4b9f-85ac-6e8392b8ee37"
    },
    {
        "references": "The shot of Anakin and his troops charging the Geonosian troops in this episode is an homage to the 1962 D-Day Classic Movie The Longest Day.",
        "source": "6ec7a304-1f3b-4cb8-868b-7c9e6f152a22",
        "id": "8b7a1019-236c-4cdd-b3bf-c117bd0c2ded"
    },
    {
        "references": "The script originally had Luminara impale a Geonosian on a broken stalagtite to introduce the idea of them being undead. In the finished episode, it's a meaty punch to a bug's midsection that clues her in.",
        "source": "7c28e0a7-89ac-41fc-a504-1738fb4033c1",
        "id": "b112e6d5-1032-4146-bdee-1294bbe127a3"
    },
    {
        "references": "The camera angle of Yularen ordering the fleet attack from the bridge of the Resolute is the same angle as Captain Needa issuing orders from the bridge of the Avenger in Star Wars Episode V.",
        "source": "93ad3aff-6561-4f9e-8f77-dc6ba82b9216",
        "id": "2cd4bb65-6e9b-485a-8972-e281d5a6c046"
    },
    {
        "references": "Noted film editor Robert Dalva takes the helm as a director for this episode. His credits as editor include The Black Stallion, Raising Cain, Jumanji, Jurassic Park III and Hidalgo. He was also director of The Last Stallion Returns. This is his first work in animation.",
        "source": "c114a38a-127f-48c5-a5ea-ee4525c58689",
        "id": "dc26d3fd-c2e4-4da2-922f-19d25380b358"
    },
    {
        "references": "The original episode guide slideshow mistakenly displayed an image of Hardcase, without his helmet on, attending to Rex after he had been shot off his BARC speeder. In the aired episode, it was Kix, the team medic, who stooped to attend to Rex, and his helmet remained on.",
        "source": "c114a38a-127f-48c5-a5ea-ee4525c58689",
        "id": "5508bba4-4441-4c2c-9376-4cfa53db87c1"
    },
    {
        "references": "The title for this episode was originally \"The Secret of Prisoner X-10\". It was changed to \"Legacy\" in September 2015",
        "source": "a6daf202-d900-4728-acb0-b568a8af9bdf",
        "id": "f04135a2-20d2-47dc-8040-03f5a954495e"
    },
    {
        "references": "Ryder Azadi's placeholder name during development was Vol Freilus. He is voiced by Clancy Brown, who played Savage Oppress in Star Wars: The Clone Wars.",
        "source": "a6daf202-d900-4728-acb0-b568a8af9bdf",
        "id": "4b14efce-6a4e-4991-baf6-296776cc7130"
    },
    {
        "references": "The outfit young Leia wears in this episode is based on early Ralph McQuarrie concept art of Princess Leia done for the original Star Wars.",
        "source": "4b982881-6ae4-4ea9-bcc3-759a2fa43808",
        "id": "b12b0600-8c94-4ae9-9c1c-e476c36c1b63"
    },
    {
        "references": "The clasp holding Leia's hair together is based on shapes seen on Bail Organa's wardrobe in Episode III",
        "source": "4b982881-6ae4-4ea9-bcc3-759a2fa43808",
        "id": "f0869e12-8587-4026-a7e1-701063486f26"
    },
    {
        "references": "The style of the confrontation between Kanan and Fenn Rau is deliberately staged as a Western.",
        "source": "0e45bbab-8fb5-4280-8e8b-58e3591f6735",
        "id": "456c12df-d929-4e4e-b54c-add53c368cff"
    },
    {
        "references": "Supervising dirdector Dave Filoni named the character of Fenn Rau after episodic director Brad Rau",
        "source": "0e45bbab-8fb5-4280-8e8b-58e3591f6735",
        "id": "95a73c56-043b-469d-96d2-b90698480b0c"
    },
    {
        "references": "The markings on the top of Fenn Rau's helmet are from early Joe Johnston artwork exploring Boba Fett for The Empire Strikes Back",
        "source": "0e45bbab-8fb5-4280-8e8b-58e3591f6735",
        "id": "8666ce7a-0829-470d-a075-5e6cb0d5b416"
    },
    {
        "references": "La pièce musicale du voyage dans le Star Cluster.. ressort vraiment des autres. Très bon cue. Juste des cordes en musique de chambre. The music in this episode was inspired by the work of composer Philip Glass.",
        "source": "b6a4fbfe-35e0-422f-aebe-f580144f2651",
        "id": "dcaa2d34-6d1e-488a-8ead-f51bfc62445d"
    },
    {
        "references": "Chava refers to her belief in the \"Ashla\". In George Lucas' early story treatments for the original Star Wars, the dark and light aspects of the Force were given proper names: The Bogan and the Ashla. In fact, Ahsoka's early name during the development of The Clone Wars was \"Ashla\".",
        "source": "b6a4fbfe-35e0-422f-aebe-f580144f2651",
        "id": "a747bc73-32b4-40f6-bbbb-93b622fb09d4"
    },
    {
        "references": "The working title for this episode was \"Legacy of the Lasat,\" but thiw was changed when an earlier episode this season was renamed \"Legacy.\"",
        "source": "b6a4fbfe-35e0-422f-aebe-f580144f2651",
        "id": "b00612ad-c7ed-4764-bc15-e6ce22c9f481"
    },
    {
        "references": "Tera Sinube's design is based on an abandoned alien concept illustrated for Epiosde I Senators. Although Tera appeared previously in \"Grievous Intrigue,\" he and the younglings seen in that episode were designed for this episode, which was produced first.",
        "source": "700bf51c-2aea-4378-aa96-816cacadb405",
        "id": "46c1eabf-5ba9-4423-8d4a-3b7efec08a5e"
    },
    {
        "references": "The design for Boss Yushyn is based on a rough sketch of a bounty hunter alien that Ralph McQuarrie ilustrated during the production of the Empire Strikes Back",
        "source": "be8feb3f-da7a-43cc-963d-84ae821aa635",
        "id": "26632daf-3ec6-45db-9ddc-6b7aef544611"
    },
    {
        "references": "The original script made reference to \"The Ballad of Cham Syndulla\", a song composed by Gobi Glie and written for an online web comic that accompanied the first Season of the Clone Wars.",
        "source": "e38dfa48-4235-4888-ae70-5c12d62e0501",
        "id": "5335f251-69e4-4f7d-85d2-94b5170d37f7"
    },
    {
        "references": "On Numa's upper left arm, the word \"Boil\" is written in aurebesh as well as a particular crest in reference to the clone troopers that rescued her in Star Wars: The Clone Wars. She also has a faded Tooka illustration on her tunic.",
        "source": "e38dfa48-4235-4888-ae70-5c12d62e0501",
        "id": "a8a73d61-decc-4f3c-9c01-551aa3408786"
    },
    {
        "references": "The Bonzami creature is named after a Zamboni",
        "source": "21f42d97-4a2d-4f51-bf63-581de88d06c7",
        "id": "800224e0-9af1-42f6-9870-e19b3923ede5"
    },
    {
        "references": "The design of the bonzami's horn and beak is inspired by that of a truck-mounted snowplow.",
        "source": "21f42d97-4a2d-4f51-bf63-581de88d06c7",
        "id": "832c8cfc-e8c5-4f45-83ee-bae4bdee7ce1"
    },
    {
        "references": "The Imperial construction sphere is inspired by early Revenge of the Jedi Ralph McQuarrie artwork of multiple Death Stars being built.",
        "source": "21f42d97-4a2d-4f51-bf63-581de88d06c7",
        "id": "4401dc6a-7e6e-4643-a96b-6318ecce5e78"
    },
    {
        "references": "The lightsabers in the training dojo were repurposed/redressed animation props, including ring-less Inquisitor lightsabers, Temple Guard lightsabers, and lightsabers belonging to Ki-Adi-Mundi, Luminara Unduli, Kit Fisto and Adi Gallia.",
        "source": "ab4c6b00-392a-4b48-8f51-3c2a8129334e",
        "id": "ff3f504d-eb79-4afd-8e11-7bdea25cefb6"
    },
    {
        "references": "For Anakin Skywalker's lightsaber training, The Rebels team reviewed Episode III-era reference footage of stunt coordinator and sword master Nick Gillard giving a lightsaber lesson to a video games team.",
        "source": "ab4c6b00-392a-4b48-8f51-3c2a8129334e",
        "id": "bf7d0afb-e353-4240-9ca2-7a64fc60b7e2"
    },
    {
        "references": " AP-5 is named after series producer Athena Portillo. According to executive producer Dave Filoni, the 5 comes from Portillo's height of 5\" tall.",
        "source": "e79f55c3-b6b7-4c4d-b693-2c0ce7357d0e",
        "id": "a868f0d2-94d8-4d31-8667-f79684ee325c"
    },
    {
        "references": "AP-5's design stems from the Death Star Droid, and his proportions better match the early Ralph McQuarrie sketches of that character, particularly its rounded shoulders.",
        "source": "e79f55c3-b6b7-4c4d-b693-2c0ce7357d0e",
        "id": "7e83dbe4-f02f-4c44-8b4d-6409bcca5980"
    },
    {
        "references": "The krykna spider creatures are based on Ralph McQuarrie artwork of enormous arachnids found in the swamps of Dagobah.",
        "source": "c275156f-47db-4833-903d-2779f6a9d703",
        "id": "11cb603e-f8a5-4ae5-ae0e-d5a09f7474d9"
    },
    {
        "references": "The conversation Ahsoka has with Rex at the start of the episode is a mirror of their very first conversation they had, as seen in the Star Wars: The Clone Wars feature.",
        "source": "01737539-2ff2-438f-8784-9875010704af",
        "id": "53d513c5-818d-424a-be64-6ad0d44f7ca9"
    },
    {
        "references": "During the development of this episode, Dave Filoni drew heavily from mythological depictions of the internal underworld, delineating specific levels of descent.",
        "source": "01737539-2ff2-438f-8784-9875010704af",
        "id": "fc4d225f-3691-433a-855d-3adfd8577c1e"
    },
    {
        "references": "The petrified bodies that line the battlefield of Malachor were inspired by the impressions of figures left behind after the devastation of ancient Pompeii.",
        "source": "01737539-2ff2-438f-8784-9875010704af",
        "id": "dfd3d3b1-541c-4778-ba41-8e35daa5bbd9"
    },
    {
        "references": "Although the final cut of Return of the Jedi has an eyebrow-less unhelmeted Darth Vader, to better read in animation, the animation model has the dark brow visible through the cracked helmet.",
        "source": "01737539-2ff2-438f-8784-9875010704af",
        "id": "8c854da7-2282-4ab3-9531-f4f10a570dff"
    },
    {
        "references": "The first explorations of this story had a duel between Maul and Vader in the Second Act, but the evolution of the script and the realization that it was one duel too many spared Maul that confrontation.",
        "source": "01737539-2ff2-438f-8784-9875010704af",
        "id": "49192703-dbc3-42d7-ada1-656f42f244b3"
    },
    {
        "references": "In the original outline, the infernal machine at the heart of the Sith Temple actually completes its firing cycle. In the finished episode, the removal of the holocron cuts the cycle short.",
        "source": "01737539-2ff2-438f-8784-9875010704af",
        "id": "4cf0f3ee-7b7a-4942-b7e8-e2d8074efef7"
    },
    {
        "references": "The original script had Maul say this about Malachor: \"Palpatine brought me here when I was a boy. My master had long studied the ancient dark arts, he sought out relics, and locations like this.",
        "source": "01737539-2ff2-438f-8784-9875010704af",
        "id": "6987e715-25d0-467e-afd2-548a06b58cff"
    },
    {
        "references": "Thème de CLone Wars présent lors d'une action héroïque de Rex.",
        "source": "f79eee49-df64-4c94-abc3-80d591f24e8a",
        "id": "6f6a9eec-6f3d-4e34-81df-e23e52ae1c1a"
    },
    {
        "references": "One version of Hondo's reaction to Terba's spectacular demise was to remark breathlessly: \"They can fly!\"",
        "source": "f79eee49-df64-4c94-abc3-80d591f24e8a",
        "id": "bc21a649-ebb8-4b13-a117-6360d0d77e16"
    },
    {
        "references": "The concept of Bendu was originally explored for Season 2, and was to factor into \"The Mystery of Chopper Base.\" In early exploration of that story, Bendu was much, much bigger and rebels had inadvertently built Chopper Base on Bendu's back. Upon returning from a mission, they'd find their base gone because Bendu had moved.",
        "source": "f79eee49-df64-4c94-abc3-80d591f24e8a",
        "id": "bd271324-cad9-40d2-afb7-8794ee5c300f"
    },
    {
        "references": "The term Bendu dates back to the original story treatments written by George Lucas when he was first defining Star Wars in 1973. The Jedi Knights were atlernately called the Jedi Bendu, and the light and dark side aspects of the Force were called the Ashla and the Bogan, respectively.",
        "source": "f79eee49-df64-4c94-abc3-80d591f24e8a",
        "id": "08d15e54-b9fd-4d5d-abf5-9b8d8e96888a"
    },
    {
        "references": "The writer who pitched the destruction of the Phantom was jokingly nicknamed \"The Phantom Menace\" for much of the season.",
        "source": "f79eee49-df64-4c94-abc3-80d591f24e8a",
        "id": "201edf4e-ec4e-4ef0-978c-7cdd40e53cc2"
    },
    {
        "references": "Describing the signal beacon that repels the Atollon spiders as a \"thumper\" is a reference to the Dune series of novels, where a similar device is used to attract sand worms.",
        "source": "d34701f0-814c-47f5-ac6b-48e164a6c094",
        "id": "deaf8c43-29a0-4a15-a5dc-42fb13f66873"
    },
    {
        "references": "During early development, this episode was titled \"Darklighter\" and dealt with the defection of Biggs Darklighter into the rebel ranks, but timeline complications with Biggs' established A New Hope backstory meant that Wedge was the better candidate.",
        "source": "d0adcd38-78bb-4b78-ad07-40f034db095a",
        "id": "c1efd518-e920-4e94-b3c2-3fbc5ab86d68"
    },
    {
        "references": "The horned icon on Vult Skerris' helmet can be found on the side of the original scout walker effects model built for The Empire Strikes Back (though it is absent from the ones seen in Return of the Jedi). It is featured quite prominently on the original Kenner toy of the scout walker.",
        "source": "d0adcd38-78bb-4b78-ad07-40f034db095a",
        "id": "eaf1e202-8aa3-4751-a91c-c95449f2777e"
    },
    {
        "references": "This episode was written by screenwriter Gary Whitta, who joined the Rebels Season 3 writing team after his work on Rogue One. Sabine's alias (Ria Talla) in the Academy is a leftover name from an early version of the movie.",
        "source": "d0adcd38-78bb-4b78-ad07-40f034db095a",
        "id": "8b48a54b-76cd-4d72-a6b2-b724451e2882"
    },
    {
        "references": "The rigged charges that separate the solar collectors from the escaping TIE Fighters are a nod to the old Kenner toy functionality - kids could pop off the wings of the original TIE with the push of a button to simulate \"Battle damage.\"",
        "source": "d0adcd38-78bb-4b78-ad07-40f034db095a",
        "id": "7bfd420f-5637-4625-ab05-d3eb19f987da"
    },
    {
        "references": "In the outline stage, the unnamed Academy instructor was going to be Baron Valen Rudor first seen in Season One.",
        "source": "d0adcd38-78bb-4b78-ad07-40f034db095a",
        "id": "4ea2843e-287a-4c28-862b-8fa5d5088191"
    },
    {
        "references": "The somewhat elongated shape of the Mandalorian helmets in this episode were inspired by the Boba Fett animation model used by Nelvana in the making of The Star Wars Holiday Special and Droids television series.",
        "source": "e8e59c4a-854a-4666-87f5-2b0dff1940e7",
        "id": "1a84d6a0-912e-4835-bb0e-097ade3be1f9"
    },
    {
        "references": "The high-tech and sterile environs of Mandalore were in some ways inspired by THX 1138. The repeated cube imagery extends to the cubist painting seen in the various Mandalorian spaces, including an epic painting done in the style of Picasso's famous Guernica.",
        "source": "e8e59c4a-854a-4666-87f5-2b0dff1940e7",
        "id": "a50618aa-cd39-4c50-87d6-7c059a94d786"
    },
    {
        "references": "Duchess Satine and her royal guards were inspired by abandoned design concepts for Episode 1. Satine was based on a Queen Amidala illustration by Iain McCaig, while the guards were a Sith Exploration also by McCaig.",
        "source": "e8e59c4a-854a-4666-87f5-2b0dff1940e7",
        "id": "d4a23dfc-feb0-4612-a144-4a14287b822f"
    },
    {
        "references": "When the Syndulla house explosively erupts, one of the stormtroopers caught in the blast emits the famous \"Wilhelm scream,\" a sound effects easter egg found in many movies, including the Star Wars films.",
        "source": "5246821f-7d61-4002-9427-0ae9a3248e7f",
        "id": "56ef500f-0084-4ce2-8443-67e9f34ccce0"
    },
    {
        "references": "Updating hte battle droid model had long benn on the wish-list of the Lucasfilm Animation team working on Star Wars: The Clone Wars, but it was never prioritized. As such, the same design lasted throughout the run of the series. The upgrade - which results on the droid more closely resembling its live-action incarnation - finally occurs for Star Wars Rebels.",
        "source": "6cdbd882-461a-462e-90f4-501536aab7c2",
        "id": "cf92aa78-016f-4aa1-93dc-b569e603c754"
    },
    {
        "references": "Returning to provide the voice of General Kalani is Gregg Berger, who voiced Kalani in Season 5 of Star Wars: The Clone Wars.",
        "source": "6cdbd882-461a-462e-90f4-501536aab7c2",
        "id": "5bcae35e-f750-4db3-bff8-d9d4b2e6a034"
    },
    {
        "references": "The march of the battle droids uses a theme composed by Kevin Kiner for the very first season of Star Wars: The Clone Wars.",
        "source": "6cdbd882-461a-462e-90f4-501536aab7c2",
        "id": "e05e1e4e-9eae-4532-835f-765b755d9f6c"
    },
    {
        "references": "In the original outline of the episode, Ezra was to befriend battle droid B1-268 and nickname him \"Clanky,\" but this was cut early in the episode's production.",
        "source": "6cdbd882-461a-462e-90f4-501536aab7c2",
        "id": "8e48b8ea-918c-448d-ba5d-f0d278544a0f"
    },
    {
        "references": "The end title card has been redesigned to resemble the opening title card on Star Wars: The Clone Wars, and this episode uses the end theme music from that animated series.",
        "source": "6cdbd882-461a-462e-90f4-501536aab7c2",
        "id": "add0f878-5687-4da0-8eca-5e50b722de89"
    },
    {
        "references": "The idea of Imperial super commandos dates back to the very earliest concept work done for The Empire Strikes Back. Preliminary story explorations would have had a class of \"super\" stormtroopers, which resulted in all-white designs of what would become Boba Fett's Mandalorian armor as the story evolved.",
        "source": "529ff5d0-c49a-4b6e-aedc-4a85061afce7",
        "id": "a931b109-86b6-4602-9e71-f2e77894a281"
    },
    {
        "references": "A key influence on the development of this episode was the original Red Dawn movie (1984), which featured a group of teenagers defending their home town from invading forces. As initially discussed, the Iron Squadron are basically a bunch of teens in their pickup truck.",
        "source": "339d777a-dad1-44cb-a01b-5bfe91266920",
        "id": "1c220ea3-c023-48a7-94c6-fe097e61d105"
    },
    {
        "references": "This episode's new cast of characters and their homeworld are tributes to the staff of Lucasfilm's online team who spread the word about Star Wars Rebels via Rebels Recon.",
        "source": "339d777a-dad1-44cb-a01b-5bfe91266920",
        "id": "8d1e947e-a559-413e-a564-0a5f5f379d60"
    },
    {
        "references": "Gooti Terez is named after Andi Gutierrez, host of Rebels Recon. Her character design is based on the Theelin species first seen as one of the background singers in the Special Edition release of Return of the Jedi.",
        "source": "339d777a-dad1-44cb-a01b-5bfe91266920",
        "id": "79df3308-4da4-43bd-abdb-b684daa1725b"
    },
    {
        "references": "Mart Mattin is named after Matt Martin. Now a member of the Lucasfilm Story Group, he was a producer on Rebels Recon and helped create The Star Wars Show.",
        "source": "339d777a-dad1-44cb-a01b-5bfe91266920",
        "id": "a7d7753e-ad48-4c1d-bce3-4b0c9bbb1316"
    },
    {
        "references": "Jooner Jin is named after John Harper, producer of Rebels Recon and The Star Wars Show.",
        "source": "339d777a-dad1-44cb-a01b-5bfe91266920",
        "id": "b36b3e9c-f2af-4378-a0e4-5b28f75c5cfe"
    },
    {
        "references": "The planet Mykapo is named after Mickey Capoferri, Executive Producer of Rebels Recon and The Star Wars SHow.",
        "source": "339d777a-dad1-44cb-a01b-5bfe91266920",
        "id": "d89b371e-56fc-404b-ba7f-7452435c5e78"
    },
    {
        "references": "The original name of the episode was the COMMODIA JOB (and later, PIRATES OF THE CAMMODIA SYSTEM) as the planet's spiral flush of atmospheric turbulence inspired a toilet joke or two. Better taste prevailed, and the planet was renamed Wynkathu.",
        "source": "aa3faa14-e7cc-4c7d-b60f-536b74135083",
        "id": "d753851c-b9d6-4245-a1f4-708a1ac510c9"
    },
    {
        "references": "During develpment, the story was likened to be a cross between a disaster movie and a heist flick. As an analogy during the story conference, the cargo ship was likened to a World War II German train filled with looted European treasure. The theme, \"Working together is always more profitable than only looking after your own interests.\"",
        "source": "aa3faa14-e7cc-4c7d-b60f-536b74135083",
        "id": "04a8da28-56a0-42dc-ac25-05ec8c3467f4"
    },
    {
        "references": "The broadcast order this episode, production number 311 (\"An Inside Man\") and 310 (\"Visions and Voices\") were swapped after production started, partially because of thematic connections between 310 and 312.",
        "source": "d22fff43-1bc1-4f1f-97ac-e62dde7af1ed",
        "id": "75c55646-6568-4e97-a505-53240c72a862"
    },
    {
        "references": "Mr. Sumar nearly made an appearance in the Season Two opener, where he was going to be depicted as very anti-rebel, angered at the actions the rebels took that resulted in the death of Minister Tua, and the enhanced Imperial security they provoked.",
        "source": "d22fff43-1bc1-4f1f-97ac-e62dde7af1ed",
        "id": "a1c4d932-1c6c-40d8-9b81-6a98d25634b8"
    },
    {
        "references": "Working titles for this episode included \"Dark Blade of Dathomir\" and \"The Boy Who Cried Maul.\"",
        "source": "d49eb823-8fcd-4f37-9e7f-42160979f885",
        "id": "620cce43-4349-4d64-bec7-27cd3dbc0c22"
    },
    {
        "references": "When describing the haunting visions of Maul that Ezra has at the start of the episode, executive producer Dave Filoni likened them to having \"a Freddy Krueger-quality\" to them.",
        "source": "d49eb823-8fcd-4f37-9e7f-42160979f885",
        "id": "972bc804-ec15-4e0f-9a52-be5e17dd5428"
    },
    {
        "references": "Composer Kevin Kiner quotes a small, piano-only refrain from Duchess Satine's theme in the score when Ezra looks at her painting.",
        "source": "d49eb823-8fcd-4f37-9e7f-42160979f885",
        "id": "874d3e09-d72d-48a6-8956-545501832a3a"
    },
    {
        "references": "Meredith Salenger and Anna Graves, two recurring actors from The Clone Wars, return to voice the Nightsister-possessed incarnations of Kanan and Sabine.",
        "source": "d49eb823-8fcd-4f37-9e7f-42160979f885",
        "id": "7977920c-02be-4a64-a811-80aed92ed8f5"
    },
    {
        "references": "Sabine dit: \"Stupid Sand, it gets everywhere\".",
        "source": "75f8673e-ba46-4308-a802-8b246f5819cd",
        "id": "b5a25337-8331-4fed-8a5e-5de44ae93bc9"
    },
    {
        "references": "Imperial Captain Brunson is named for the series Look Development Production Coordinator Jessica Brunson.",
        "source": "75f8673e-ba46-4308-a802-8b246f5819cd",
        "id": "3e2e9d01-8320-4b64-928e-00b71a1862ee"
    },
    {
        "references": "Klik-klak proved an opportunity to do something never attempted before: create a sympathetic Geonosian. The production team pointed towards District 9 as an example where an insectoid alien could be turned into something other than creepy through portrayal and circumstance.",
        "source": "75f8673e-ba46-4308-a802-8b246f5819cd",
        "id": "2c47a8ce-c69f-47e8-8a0e-4a742dcde0c7"
    },
    {
        "references": "The jetpack-wearing jumptrooper is based on the flying stormtroopers developed for Star Tours: The Adventure Continue.",
        "source": "75f8673e-ba46-4308-a802-8b246f5819cd",
        "id": "911e0b51-8bb8-4acf-883e-514b449184e0"
    },
    {
        "references": "The ongoing gag in the episode is Klik-Klak is literally drawing an image of a Death Star, yet everyone plausibly interprets as something else (rings of Geonosis, an egg, the gas canisters).",
        "source": "75f8673e-ba46-4308-a802-8b246f5819cd",
        "id": "bee801f7-9db5-4d2c-8222-fa5615e93767"
    },
    {
        "references": "Anakin identifying Obi-Wan's anxiety over meeting with the duchess while traveling aboard a turbolift is a mirror of a similar scene in \"Attack of the ClonesL, with the Jedi roles reversed. ",
        "source": "1323b45d-33ee-4fcb-a4b5-e849b10128a9",
        "id": "a4decd3c-6615-4111-96d6-7dc66c2ec90c"
    },
    {
        "references": "This was the first episode of the Mandalorian arc produced, well before the adjacent episodes. The figure of Pre Viszla does not use his final character design in holographic form. If his serape was removed, he would be revealed to be wearing clone armor!",
        "source": "1323b45d-33ee-4fcb-a4b5-e849b10128a9",
        "id": "7c6c28c9-4099-483c-b6fd-97e4800d9936"
    },
    {
        "references": "Tal Merrik is voiced by Greg Proops, who also supplied the voice of the podrace announcer Fode in Episode 1: The Phantom Menace.",
        "source": "1323b45d-33ee-4fcb-a4b5-e849b10128a9",
        "id": "a760cf63-7b1c-4e2d-9e82-fdc3af785888"
    },
    {
        "references": "In the original story pitch (dated July 2015), the episode \"Warhead\" was a smaller B-story that would have occured while the events of the next episode, \"Trials of the darksaber\" formed the A story. Both stories grew to become full-fledged episodes.",
        "source": "4a5e2e42-c506-4b7e-810d-5b34d66e698a",
        "id": "2783d761-edbc-4527-93a9-2c33444e87b9"
    },
    {
        "references": "The next, more detailed revision a month later had a focus on Zeb and Rex in the episode, rather than teaming up Zeb with the droids.",
        "source": "4a5e2e42-c506-4b7e-810d-5b34d66e698a",
        "id": "2a1cef8e-0a68-4b98-9629-55e7c969f7ce"
    },
    {
        "references": "The opening sequence in staging, sound design and music are homages to the opening scenes of The Empire Strikes Back, with a Star Destroyer launching multiple probots pods. That the droid is accosted by native life-forms was once a fate that befell the Probot on Hoth, as the early Empire script described the probe droid firing on a wampa ice creature.",
        "source": "4a5e2e42-c506-4b7e-810d-5b34d66e698a",
        "id": "eab218bb-71cf-4655-9e6e-3db160fe554c"
    },
    {
        "references": "The explosive countdown display in the infiltrator droid's body is a visual nod to a similar device used by the alien hunter in the movie Predator.",
        "source": "4a5e2e42-c506-4b7e-810d-5b34d66e698a",
        "id": "d8e9d1a0-b8d8-4343-8f5d-af66973aba6e"
    },
    {
        "references": "The image from the infiltrator droid's point of view is layered with read-out text that includes the episode production number (WOLF314)",
        "source": "4a5e2e42-c506-4b7e-810d-5b34d66e698a",
        "id": "736c03e8-0a50-444b-b258-62c73a32524d"
    },
    {
        "references": "The working title for this episode was \"The Blade Trials\"",
        "source": "f79ee7da-0184-4e14-90e6-a0705f08ad66",
        "id": "c0abfbaa-bc7a-4e9d-bf2b-fb0c9b8cef6c"
    },
    {
        "references": "In the outline stage, Kanan would seek guidance from Bendu regarding training Sabine, but this was changed to Hera, which kept it in the \"family\".",
        "source": "f79ee7da-0184-4e14-90e6-a0705f08ad66",
        "id": "84b8224d-4142-415f-8a74-4d3d154b236b"
    },
    {
        "references": "This episode has a rare example of a 2D animation being used in a 3D animated show, with the opening prologue illustrating the ancient history of Tar Viszla the Darksaber.",
        "source": "f79ee7da-0184-4e14-90e6-a0705f08ad66",
        "id": "a25a8978-8d6f-4e62-92ae-ae61b2cec2fb"
    },
    {
        "references": "The look of the Wren mansion on Krownest is strongly influenced by Frank Lloyd Wright \"Prairie\"-style architecture, but with a Mandalorian easthetic. This was the architecture of the Big Rock campus of Skywalker Ranch where Lucasfilm Animation operated before moving to San Francisco.",
        "source": "ad4f5b15-b02a-41b4-ab8c-9776e7f54481",
        "id": "50bafe87-0eb2-4ec2-a2b2-6efe75427aad"
    },
    {
        "references": "The portrait of Ursa Wren seen in the great hall of the Krownest mansion is done in a style similar to that of Gustav Klimt.",
        "source": "ad4f5b15-b02a-41b4-ab8c-9776e7f54481",
        "id": "7c738548-7e88-40bb-baad-ca02bf6cde20"
    },
    {
        "references": "The idea of Sabine having a sibling has been a story thread evolving over the course of the series. In series preproduction, Sabine was to have a twin sister named Sacha. Later, it was changed to a brother, and at one point, the character was to be the Protector of Concord Dawn. This was changed to Fenn Rau as that episode developed.",
        "source": "ad4f5b15-b02a-41b4-ab8c-9776e7f54481",
        "id": "208298b5-6338-45b2-b257-a0f0632b442c"
    },
    {
        "references": "Early in this story's development, Tristan's name was Jona Wren.",
        "source": "ad4f5b15-b02a-41b4-ab8c-9776e7f54481",
        "id": "e299c7a5-a5a1-45a2-9013-ffd05367ef32"
    },
    {
        "references": "Deputy Minister Jerec's description of the tumultuous time on Mandalore as \"a period of civil war\" echoes the original title crawl from A New Hope.",
        "source": "12c1f8bd-c3b5-4297-8cf5-54a7eb2fac6e",
        "id": "a04d1a95-fa6a-4e3b-8c6c-45ad47e7ac7b"
    },
    {
        "references": "A particular story thread cut from the episode would have placed Anakin Skywalker in command of the Republic invasion of Mandalore. Periodically, the story was to cut to Anakin making preparations.",
        "source": "12c1f8bd-c3b5-4297-8cf5-54a7eb2fac6e",
        "id": "e8e7aff1-a981-4c04-96cf-4bf0bc4aba4b"
    },
    {
        "references": "According to the script, the Ithorian's translated dialogue to the clone troopers is, ironically, as follows: Clone 1: If you see this woman, report her to local authorities. ALien: Yeah, yeah. I just saw her! Clone 2: I don't think he understands us. Let's try someone else. Alien: No wait! She's over there!",
        "source": "12c1f8bd-c3b5-4297-8cf5-54a7eb2fac6e",
        "id": "ee07d83e-f14f-4f7b-9501-5820c0f472c1"
    },
    {
        "references": "The Coruscant park is based on several pieces of Ralph McQuarrie concept art. The plaza also includes a large boulder at its center -- a nod to a detail seen in McQuarrie's work suggesting the sole exposed mountain peak on Coruscant's covered surface. Some of the original design development of this monument looked at the actual boulder found on the road to Lucasfilm Animation's northern california headquarters. it is this boulder that gives the Big Rock campus of Skywalker Ranch its name.",
        "source": "12c1f8bd-c3b5-4297-8cf5-54a7eb2fac6e",
        "id": "aacdbc1d-31bf-48c3-a67d-eb862dbe8655"
    },
    {
        "references": "This episode was originally slotted to be the 16th episode of the season (Production number 316), and was produced on that schedule, but was shuffled after completion in order to now land as the 18th episode of the season, thus keeping the two Darksaber episodes united.",
        "source": "755b841f-5f37-4035-b38f-41b3bfe2653a",
        "id": "aabf35f1-553d-41d2-9685-dd745415b819"
    },
    {
        "references": "Early in planning this episode, there was some conversation about doing the whole thing from a first-person perspective, but such an approach would end up being far more complicated than the production schedule would allow.",
        "source": "755b841f-5f37-4035-b38f-41b3bfe2653a",
        "id": "33051c93-1005-435f-ad99-b4ba10de16b7"
    },
    {
        "references": "Genevieve O'Reilly reprises her role as Mon Mothma. She first played the senator in Star Wars: Revenge of the Sith and returned nearly a decade later for Rogue One: A Star Wars Story.",
        "source": "2c175094-dfe4-4ac9-8309-b3a394156dd1",
        "id": "a8f55811-f7b3-4ad8-8ab4-cbc500b55e47"
    },
    {
        "references": "Josh Brener, a long time Star Wars fan, provides the voice for Erskin Semaj. He plays Dale in Big Bang Theory and Big Head in Silicon Valley",
        "source": "2c175094-dfe4-4ac9-8309-b3a394156dd1",
        "id": "e15a5bab-c080-4a64-a420-1cfdd3ce43dc"
    },
    {
        "references": "In the script, Gold Three was named Tyson.",
        "source": "2c175094-dfe4-4ac9-8309-b3a394156dd1",
        "id": "a5103828-ab9f-465d-b194-777639a8e00f"
    },
    {
        "references": "The original premise for the episode had Killun station be a revisit of Rishi Outpost, a listening base on the Rishi moon seen in the first season of Star Wars: The Clone Wars.",
        "source": "006592af-cd76-456d-be6d-0368937cc275",
        "id": "81031bf0-477a-4c08-924d-bf1c75a6f21e"
    },
    {
        "references": "The listening ship design is an Imperial freighter with additional sensor and transmitter dishes, inspired by real-world AWACS planes used in air defense.",
        "source": "006592af-cd76-456d-be6d-0368937cc275",
        "id": "920b895c-4222-4f07-905e-444459c542bc"
    },
    {
        "references": "The staff aboard the controller and their operations center was very much inspired by the soulless control rooms seen in George Lucas' first feature film, THX 1138",
        "source": "006592af-cd76-456d-be6d-0368937cc275",
        "id": "14ec9118-6741-44d3-bdcb-788e9c36a35f"
    },
    {
        "references": "Controller LT-319 was designed to resemble Pablo Hidalgo, Lucasfilm Story Group creative executive, who regularly fields fan questions on Rebels Recon. Hidalgo recorded the temp voice for the character, who was ultimately played by Josh Gad.",
        "source": "006592af-cd76-456d-be6d-0368937cc275",
        "id": "24f24c8a-2e28-4fc8-9908-599a293188e3"
    },
    {
        "references": "The earliest iterations of this story had Kanan accompany Ezra. Chopper did not come along and rather stayed at Atollon to be at Hera's side.",
        "source": "d447b3dd-1ef8-4350-8247-16a9c62eeb6c",
        "id": "76f92b79-2b45-4e57-a288-5f9d21c41847"
    },
    {
        "references": "The holocron fragments guiding Ezra's path were not always in the story. Instead, there was more to Ezra (and Kanan) arriving on Tatooine and following a path of clues left by Maul.",
        "source": "d447b3dd-1ef8-4350-8247-16a9c62eeb6c",
        "id": "cf613c92-605f-4b0b-8a1a-08f96086bdf7"
    },
    {
        "references": "The episode originally called for a character named Moota Engatoo. Engatoo was fully designed prior to being cut from the episode. He was a merchant in a remote outpost that would tell Ezra some information on where to go next in his search for Maul.",
        "source": "d447b3dd-1ef8-4350-8247-16a9c62eeb6c",
        "id": "0937b5e2-52e5-4d66-a86f-a089abc166e4"
    },
    {
        "references": "To save valuable time and ressources in animation rendering, the Tusken Raiders were designed to not have flowing robes.",
        "source": "d447b3dd-1ef8-4350-8247-16a9c62eeb6c",
        "id": "dcaa0814-d4f1-48c8-bc54-514e0a898b01"
    },
    {
        "references": "Luke Skywalker would be the same age as Ezra (give or take a few days); in fact, the animation model seen only in sihouette is a reuse of the Season 3 Ezra Bridger model.",
        "source": "d447b3dd-1ef8-4350-8247-16a9c62eeb6c",
        "id": "db6ef039-1277-4fc8-9707-735884259721"
    },
    {
        "references": "The original story premise for the episode likened Ezra getting used to his jetpack to Cliff Secord doing the same in the 1991 movie The Rocketeer. Ina fitting bit of connectivity, THe Rocketeer was directed by Joe Johnston, the ILM artists most responsible for designing Boba Fett and his jetpack for The Empire Strikes Back.",
        "source": "afac6d23-59c5-424b-8e3a-77b09081b296",
        "id": "bbaa2055-8f25-48aa-8e25-bae1ec853464"
    },
    {
        "references": "Andrew Kishino provides the voice of the Imperial Mandalorian Captain Hark. Kishino voiced the original animated incarnation of the young Saw Gerrera in Star Wars: The Clone Wars.",
        "source": "afac6d23-59c5-424b-8e3a-77b09081b296",
        "id": "b036c74e-73a6-4c97-a32f-2c836bc67c11"
    },
    {
        "references": "Continuing a growing tradition, an actor who was a veteran of the series Rome plays a Mandalorian leader. This time it's Tobias Menzies (who played Marcus Junius Brutus) as Tiber Saxon. Other Rome alumni include Kevin McKidd (who played Lucius Vorenus) as Fenn Rau, and Ray Stevenson (who played Titus Pullo) as Gar Saxon. ",
        "source": "afac6d23-59c5-424b-8e3a-77b09081b296",
        "id": "1588cd02-da0d-408e-9ce7-fd5bbf128bd1"
    },
    {
        "references": "The chase to save Alrich Wren from the inside of a troop transport was inspired by both the truck chase in Raiders of the Lost Ark, and the tank chase in Indiana Jones and the Last Crusade.",
        "source": "afac6d23-59c5-424b-8e3a-77b09081b296",
        "id": "5e90c209-6b55-46b0-b9b4-8e2c809cc98e"
    },
    {
        "references": "This episode was first publicly shown at Star Wars Celebration Orlando on April 15, 2017, a full six months before its television debut.",
        "source": "afac6d23-59c5-424b-8e3a-77b09081b296",
        "id": "34209628-51ea-4a25-b2bc-aa22be312f5f"
    },
    {
        "references": "An earlier iteration of the story had Sabine \"knighting\" her Mandalorian soldiers with the darksaber, creating a scorch mark on their armor.",
        "source": "afac6d23-59c5-424b-8e3a-77b09081b296",
        "id": "175c5663-baae-4cdc-84f4-eabc0c149928"
    },
    {
        "references": "That Sabine had developed weapons for the Empire was an idea that stretched back to her original character conception, as her bio in the earliest story bible describes: \"Sabine's work was directly responsible for a terrible event perpetrated by the Empire.\" The specific details were left undefined until this story arc, where it could be most impactful.",
        "source": "afac6d23-59c5-424b-8e3a-77b09081b296",
        "id": "e6bcd4ad-3eeb-4e39-addd-0a570baedf97"
    },
    {
        "references": "Earlier drafts of the story had Bo-Katan eager to use the weapon against the Empire. When faced with the choice, however, she ultimately opts to destroy it, proving herself worthy of leadership. As the story evolved, this conflict was moved to Sabine's fiery temperament, with Bo-Katan becoming the voice of reason.",
        "source": "afac6d23-59c5-424b-8e3a-77b09081b296",
        "id": "3cd491ad-dd28-4815-9a3a-d62a5d2ff819"
    },
    {
        "references": "Mon Mothma's fiery question to Saw \"What will we become?\" echoes a line from an earlier edit of Rogue One, where Saw asks Jyn what she will become. This appears in the trailer to Rogue One.",
        "source": "d9c41e64-e727-4e8d-ae26-a5aaf9c66e29",
        "id": "c0f73a18-0147-4646-b298-c70e4ba971e9"
    },
    {
        "references": "In an earlier version of the script, Saw's pilot was going to be a new character named Lorc, who was designed to be a Klatooinian. To better connect to Rogue One, the pilot was changed to Edrio Two Tubes, with David Acord reprising his role as Two Tubes' voice.",
        "source": "d9c41e64-e727-4e8d-ae26-a5aaf9c66e29",
        "id": "7ad308ed-e501-4e4e-ad89-797678c6cf1a"
    },
    {
        "references": "The astromech droid that projects Saw's hologram, R4-C2, was originally intended to be more of a rival to Chopper, but that particular thread in this story was cut by the first draft of the script.",
        "source": "d9c41e64-e727-4e8d-ae26-a5aaf9c66e29",
        "id": "c86d2a5c-be03-4e19-b0c9-321ac926ef1e"
    },
    {
        "references": "The final draft of the script has the civilian spaceport named as Faos Station, but earlier in development it was named \"Taos Station.\" That change came too late to alter the surface texture of the station model, which has the name Taos printed in Aurebesh on its surface.",
        "source": "d9c41e64-e727-4e8d-ae26-a5aaf9c66e29",
        "id": "fef7de67-ad04-436c-9582-99b86088250f"
    },
    {
        "references": "The Death Trooper commander, DT-F16, is voiced by Jennifer Hale, who has lent her vocal talents to Star Wars many times before, most memorable as Bastila Shan in The Knights of the Old Republic videogame and Aayla Secura in Star Wars: The Clone Wars.",
        "source": "d9c41e64-e727-4e8d-ae26-a5aaf9c66e29",
        "id": "8368f70e-86dc-4fc5-a89e-0766c890ffcf"
    },
    {
        "references": "The Imperial captain of the cargo ship, unnamed in the final episode, was Captain Wells in earlier drafts of the script.",
        "source": "d9c41e64-e727-4e8d-ae26-a5aaf9c66e29",
        "id": "35a554ac-ba64-487e-87fa-b817a11e35b3"
    },
    {
        "references": "The friendly Loth-cat sounds are recordings of the late Tex, sound designer Dave Acord's cat. Tex should not be confused with Porkchop, Acord's other cat, whose purr was the source of Kylo Ren's Force rumble sound effect in The Force Awakens.",
        "source": "fc28ae70-39c7-4c32-b4c8-87bafda8bb23",
        "id": "bfe3cf8a-7412-4e99-8243-e64c4eb51d8c"
    },
    {
        "references": "In many ways, this episode is an evolution of the \"we stole a TIE Fighter' story from Season One' \"Fight or Flight\" episode, but now with stakes and dangers raised exponentially.",
        "source": "fc28ae70-39c7-4c32-b4c8-87bafda8bb23",
        "id": "256ef646-44af-4d7f-9f9e-f8a04673e306"
    },
    {
        "references": "Working Titles for this episode include: \"Direct Impact\", \"Crawler Assault,\" and \"Crawler Commandeers\".",
        "source": "eb99db1f-799a-4516-a96d-e7961b2df20e",
        "id": "80e2abdb-c00d-491e-b764-e1484efa658c"
    },
    {
        "references": "The burly guild slave master that Zeb brawls with is named \"Proach,\" as a nod to Pat Roach, the actor who played the Giant Sherpa and First Mechanic in Raiders of the Lost Ark and the Thuggee Chief Guard in Indiana Jones and the Temple of Doom.",
        "source": "eb99db1f-799a-4516-a96d-e7961b2df20e",
        "id": "b4d8d5ee-b815-4249-9a95-6227750c6865"
    },
    {
        "references": "This episode was originally titled \"Ascension: Part One\".",
        "source": "6afbd4ad-908e-49ee-b75d-2d613b9d22d5",
        "id": "654f79d8-7527-4949-9b8e-44bdea879daa"
    },
    {
        "references": "This episode was originally titled \"Ascension: Part Two\".",
        "source": "f652ba74-373b-4f35-aca9-03cd76bbd2a1",
        "id": "45398db2-e58e-407d-af1e-d99f335f4e4d"
    },
    {
        "references": "In an early iteration of Zeb's repeated punches of Rukh, he was saying \"I... have.. had.. enough.. of ... you!\" in a nod to James T. Kirk finally besting his Klingon opponent in Star Trek III: The Search For Spock.",
        "source": "f652ba74-373b-4f35-aca9-03cd76bbd2a1",
        "id": "6f715224-6ac7-4b02-8fda-655dae1f017e"
    },
    {
        "references": "One cinematic reference that did remain was the shot of Rukh looking back to Zeb through Zeb's binocular view. This was a nod to Rear Window.",
        "source": "f652ba74-373b-4f35-aca9-03cd76bbd2a1",
        "id": "ffd5033c-2d9a-4355-a969-10addfbdb66b"
    },
    {
        "references": "This story about the Jedi temple on Lothal was conceived as a single episode, titled \"Past, Present and Future,\" but it soon became apparent during scripting that it would take more than 22 minutes to cover all its action. When the episode was split into a two-parter, this first part was titled \"Past, Present\" before finally settling on \"Wolves and a Door.\"",
        "source": "543ec223-ca23-46f4-8e28-133ee6dba945",
        "id": "67aeff30-bf84-477d-abfb-396649d3bfbd"
    },
    {
        "references": "When exploring the connection between the Loth-wolves and the Loth-cats, the film Princess Monoke was cited as a source of inspiration, particularly the connectivity between kodama and wolves seen there.",
        "source": "543ec223-ca23-46f4-8e28-133ee6dba945",
        "id": "d3ee2db7-97b7-4476-9df8-e374a34286f7"
    },
    {
        "references": "Guest-starring in this episode as Hydan is Malcolm McDowell (From A Clockwork Orange, Halloween, Star Trek Generations) and Ian McDiarmid reprising his role as Emperor Palpatine.",
        "source": "543ec223-ca23-46f4-8e28-133ee6dba945",
        "id": "fe7da755-0c94-415b-8c0f-487243694ea2"
    },
    {
        "references": "The PA chatter that advises \"there is a safety hazard zone in standing 25 meters from the temple. Special teams are exempt, and look out for static charge,\" is a node to a similar announcement made during the arrival of the mother ship in Close Encounters of the Third Kind.",
        "source": "543ec223-ca23-46f4-8e28-133ee6dba945",
        "id": "e60ea29a-571d-4c42-9495-c3f8846d2f47"
    },
    {
        "references": "When this and the previous episode were originally planned to be a single installment, it was titled \"Past, Present and Future.\" It split into two episodes early in development, with this second part first being called \"Future.\" It was renamed \"A World Between Worlds.\"",
        "source": "1771c5a9-6977-48c1-b6eb-cc5e2f0331c1",
        "id": "df62ea4e-7d40-4f1c-b1af-5785cf06fba2"
    },
    {
        "references": "Early in development, this episode was called \"Ezra's Gambit.\" The final episode title, \"A Fool's Hope,\" is a reference to a quote from Gandalf.",
        "source": "435358bc-f502-4996-8501-b926ea6ae127",
        "id": "8fe1f4e9-743b-476e-9904-ee1c89a8ef1f"
    },
    {
        "references": "Produced as a joke for the crew was a version of  the Loth-wolf attack sequence taht replaced the cries of the stormtroopers with the sound of squeaky chew toys.",
        "source": "435358bc-f502-4996-8501-b926ea6ae127",
        "id": "87397628-b904-4572-91c5-6cc1a5dade1c"
    },
    {
        "references": "An earlier draft of the episode's script included a scene collecting the villains plotting the Empire's future, which would have called for the inclusion of Director Krennic. He was designed, but ultimately never built as the scene was cut early on.",
        "source": "435358bc-f502-4996-8501-b926ea6ae127",
        "id": "18ea3cef-4fee-4ba3-a19a-810a64cf88a0"
    },
    {
        "references": "The working titles to these episodes were \"The Light of Lothal,\" Parts One and Two.",
        "source": "775e8ab6-7fc3-47ba-8708-1b08cc937bcf",
        "id": "1a2608e7-bf7c-47cf-8743-c788e6396e8f"
    },
    {
        "references": "The shield generator has banks of capacitors that share a design with a device briefly glimpsed down a power corridor in the Endor bunker in Star Wars: Return of the Jedi. The model, quickly assembled and produced in number by ILM for Return of the Jedi is actually made from stacks of painted drinking cups.",
        "source": "775e8ab6-7fc3-47ba-8708-1b08cc937bcf",
        "id": "14e12528-9418-42dd-8082-fc5b77500741"
    },
    {
        "references": "The coda to the episode was kept under wraps from all but the crew directly working on it until the last possible moment before airing.",
        "source": "775e8ab6-7fc3-47ba-8708-1b08cc937bcf",
        "id": "2df44826-544d-4ae5-a90a-2e91a90fa9dd"
    },
    {
        "references": "Admiral Kilian is named in honor of Kilian Plunkett, lead designer for Hte Clone Wars television series",
        "source": "ca883fb3-58f0-4d2c-90a5-08adc5061546",
        "id": "7363b5ef-0be1-4286-9a1e-31010fe260e2"
    },
    {
        "references": "This episode shows a rare example of a point-of-view shot of a droid character. When R2-D2 is tangling with the gundarks, one shot is directly from hi P.O.V. with his manipulators extended. Later, when he spots the bounty hunter sppeder bikes approaching, we see that Artoo's vision mimics the view of a macrobinocular.",
        "source": "db114a0f-4651-429d-94ba-d3beb6eafd69",
        "id": "e729ecbb-091f-4d9f-a555-cec04feca62c"
    },
    {
        "references": "\"Rebellion are built on hate\" - Jeu sur la phrase dans Rogue One",
        "source": "b96c54c7-24c3-4edc-ab99-2b0a16f6cd87",
        "id": "20598ed5-1ae7-4c7b-8ae1-d57b91de3705"
    },
    {
        "references": "The bottles of tea say \"Ardees Beverage\" on it, a nod to drink established in Episode II. Originally, Obi-Wan was to order a cup of ardees in Dex's Diner, but that dialogue was changed to \"Jawa Juice\" before the movie's release",
        "source": "ad0ecd8b-b7c9-4988-874a-5ad1819d1402",
        "id": "704304ff-fc99-4b87-a290-d17caaf71071"
    },
    {
        "references": "During production, this episode was titled \"Banking Conspiracy.\" The new title, taken from a line in the opening crawl for Episode III, came much later.",
        "source": "db2e171a-cfb6-428b-947d-438154e564ac",
        "id": "c0764d39-c939-4917-a21d-f46436706061"
    },
    {
        "references": "At one point druing the food shortage, Bolza was to remark that he was out of gorgs, to which Flix and Orca would hide their pal Bitey.",
        "source": "a6c03e87-4c72-4e84-9f50-38bf785e4c40",
        "id": "88215de1-20a9-4bb7-87a7-0c998bc69beb"
    },
    {
        "references": "An earlier draft of the episode had Kaz buying the heavy blaster from Flix and Orka (with Torra's money, as Kaz is always broke). It was simplified to be a project abandoned by Tam.",
        "source": "a6c03e87-4c72-4e84-9f50-38bf785e4c40",
        "id": "364c4143-b2f5-4a9a-8c04-fe5977c36def"
    },
    {
        "references": "A gag cut from the episode was that jakoosk meat tastes horrible (although Bolza loves it). Rather than go for that laugh, the Colossus crew was instead allowed a gastronomic victory.",
        "source": "a6c03e87-4c72-4e84-9f50-38bf785e4c40",
        "id": "1b821cfa-56e4-422a-ac69-10794b0e2d31"
    },
    {
        "references": "The speagull flying into the sky projection was a very late (and hilarious) addition to the episode. Sorry, speagull.",
        "source": "a6c03e87-4c72-4e84-9f50-38bf785e4c40",
        "id": "25e8a7f1-9ac0-4098-bfa3-85fa18d09ffc"
    },
    {
        "references": "Meghan Falcone plays Nenavakasa \"Nena\" Nalor in \"The Engineer.\" If you thought she had good chemistry with Josh Brenner's Neeku, there's good reason: the actors are actually married.",
        "source": "bf061b23-e71f-426c-9dce-2a44458b1d39",
        "id": "b09d9fda-c03a-47c7-afe6-17d08ba2fedd"
    },
    {
        "references": "In an earlier cut of the episode, Neeku accompanies Kaz and Synara to Nena's battered ship. This was where they were to meet, and Neeku would have been dumbstruck upon first seeing her.",
        "source": "bf061b23-e71f-426c-9dce-2a44458b1d39",
        "id": "a5ac2448-706b-4306-9ffa-6782cdc4097a"
    },
    {
        "references": "An earlier version of the episdoe had Kaz run into Gork the Gamorrean while he was sneaking to investigate the pirate power siphoning. Synara would come to the rescue by punching Gork out cold, but then demand to know what Kaz was up to. Either way, Kaz's sneaking skills stills leave much to be desired.",
        "source": "bf061b23-e71f-426c-9dce-2a44458b1d39",
        "id": "6cc8f5ed-c0a0-4a27-8d7e-21a3afeea334"
    },
    {
        "references": "The episode originally ended with Kaz, hoping to learn more about Neeku's past, asking him about bantha herding. Neeku would then go on and on -- in great detail -- about the activity.",
        "source": "bf061b23-e71f-426c-9dce-2a44458b1d39",
        "id": "8063e34f-dc69-49ae-8fc0-99dd33e39fd9"
    },
    {
        "references": "The earliest outline of this episode began with the Colossus running out of fuel and becoming stranded in the Tammuz sector, which prompted the mission to Drahgor. In the final version, things are a little less dire.",
        "source": "55e42289-a4aa-41be-8304-d91148921b2c",
        "id": "fa018833-25a0-4cd2-bde8-a4cabf3a7903"
    },
    {
        "references": "Flanx is voiced by acclaimed actor and comedian (and alum of the beloved Mr. Show) Paul F. Thompkins. He recorded his role in the summer of 2018, which was also around the time he appeared in the 100th episode of the Star Wars Show as a \"Toy Yoda\" salesman.",
        "source": "55e42289-a4aa-41be-8304-d91148921b2c",
        "id": "aaa94858-e8a2-4971-9fb4-b0e9d532b01e"
    },
    {
        "references": "In the finished episode, a loose piece of heavy rubble prompts the elevator to freefall. An earlier version, however, had a cause potentially even more dangerous: Orka sneezing!",
        "source": "55e42289-a4aa-41be-8304-d91148921b2c",
        "id": "5370175d-030f-4d1f-bb43-b56821adc452"
    },
    {
        "references": "The earliest cut of the episode had Flix explain his dream of being a cantina singer ... in song! But ultimately, the episode ends with him saving the story for another time -- but assuring us he has an impressive set of pipes.",
        "source": "55e42289-a4aa-41be-8304-d91148921b2c",
        "id": "77527db0-c0b3-4703-a280-2407cb4a3b26"
    },
    {
        "references": "In an earlier iteration of the episode, Tam was seen to be piloting the TIE fighter that was chasing Kaz. And later, upon Venisa's arrival, it was Tam and Jace Rucklin who would have disabled her ship.",
        "source": "9c3f9ab2-96e8-4e64-bee9-f5f2ea96a016",
        "id": "687b404e-a790-4b9e-948a-81c82033f502"
    },
    {
        "references": "In the original episode outline, Venisa's droid was called Scorch. While it was later changed to Torch, both names fit based on the astromech's explosive talents.",
        "source": "9c3f9ab2-96e8-4e64-bee9-f5f2ea96a016",
        "id": "1f4f739c-1b0b-469b-863b-de242e70f807"
    },
    {
        "references": "The race circuit for the Voxx Vortex has the same layout as a real-world F1 race track.",
        "source": "d8e88309-cad0-4f87-a265-fe47f23776da",
        "id": "8b464b94-05eb-4890-bffb-378fba3ac5f8"
    },
    {
        "references": "The script originally featured a Hassk pirate named Vusk placing a curse on Kaz. This was later changed to the Nikto pirate, Leoz, who came to be voiced by Steve Blum, creating a major connection to another Star Wars animated series: Blum also voiced Zeb, one of the main characters on Star Wars Rebels.",
        "source": "1fcd092f-780e-4b05-ade6-bd261f388a83",
        "id": "844dd272-613e-4b40-bb9a-75d14d76622a"
    },
    {
        "references": "Earlier versions of the script called it the Curse of Mavala, as well as the Curse of Aka Du. One version of the story had the curse indeed be real, but Mika found it easier to remove if she let Kaz believe it was fake!",
        "source": "1fcd092f-780e-4b05-ade6-bd261f388a83",
        "id": "83770ea8-6e8b-446f-b0e4-9678433abd7c"
    },
    {
        "references": "The talisman was said, at one point, to be something Mika discovered on Mimban. Another iteration of the story had it be a toy doll that Eila was missing. Its True origins remain a mystery",
        "source": "1fcd092f-780e-4b05-ade6-bd261f388a83",
        "id": "9b8852b8-a886-46be-bbfd-9b3ab2f32341"
    },
    {
        "references": "The character of Mika Grey evolved from imagining what Asajj Ventress would be like had she survived into this era, Pablo Hidalgo of the Lucasfilm Story Group tells StarWars.com. Though not the same person, an unaffiliated Force-user who has gone through much was a strong point of inspiration for the well-traveled Mika. ",
        "source": "6857e2cc-9dac-4598-b022-65736de71019",
        "id": "d9f3e564-6af3-4a33-82de-4845e380f461"
    },
    {
        "references": "Fait une référence au vol d'épée des Galaxy's Edge",
        "source": "172925d0-659f-49a7-8f85-bd9868179ff1",
        "id": "54f01032-32ba-472e-8e4b-81ab94bedc2a"
    },
    {
        "references": "An earlier version of the story had Kaz forced to butter up Hux, appealing to his ego, in order to slip past him. Instead, a slow seething anger towards him related to the Hosnian cataclysm was deemed to be more appropriate.",
        "source": "9b3cf5c7-85f9-43de-9a0c-3408bea3202f",
        "id": "5a79f0c3-39ba-4f64-a929-824c69d4d1fb"
    },
    {
        "references": "In 2016, The Phantom Limb was adapted in the video game LEGO Star Wars: The Force Awakens.",
        "source": "35d2b50c-ae83-4e2a-bfc6-0798da6a47c6",
        "id": "db098b9e-b30e-4b54-98e3-7c86f98c662d"
    },
    {
        "references": "C-3PO mentions the events of The Phantom Limb in \"Poe to the Rescue,\" an episode of LEGO Star Wars: The Resistance Rises. ",
        "source": "35d2b50c-ae83-4e2a-bfc6-0798da6a47c6",
        "id": "c580db37-c3e5-4efb-9632-98d5510cc51a"
    },
    {
        "references": "This episode almost included a third spy. her name: Amleto, an Elomin. While she was eventually cut from the arc, the character was fully designed - maybe we'll see her someday ?",
        "source": "2a2e2bf2-6732-4d9d-9e03-c743b2b439a1",
        "id": "90811040-f09c-4534-aa06-4bd09765d4ac"
    },
    {
        "references": "Amleto's key moment in the episode was replaced with a citizen (a reuse of the marketplace vendor character from an earlier episode). Although the citizen does not speak English (\"Basic, in Star Wars terminology), the dialog was actually written in the script to convey what the alien gibberish needed to sound like.",
        "source": "2a2e2bf2-6732-4d9d-9e03-c743b2b439a1",
        "id": "a7b97772-687c-46cc-ba42-64746be2e983"
    },
    {
        "references": "The pre-title \"teaser\" segment for the episode originally had a tense standoff between Ithano and Kragan, as Kragan briefly considered paying less than originally agreed upon. Synara was also to voice more misgivings, which Kragan ignored and instead emphasized how much Synara was indebted to him. In the final epiosde, Synara is not a the weapons deal. (Maybe she's better off - the meeting site looks pretty cold.)",
        "source": "98003b28-91f1-4325-822a-7f6453ce90c7",
        "id": "cd47644e-4484-47e3-9e0d-9bdfdf682277"
    },
    {
        "references": "One of Griff's earlier lines to Kaz, cut from the episode, says a lot about a guy who doesn't say a lot: \"Here's a tip, kid: talk less. R5's been with me for years and we've barely spoken. It's the best relationship I've ever had.\" Fitting, then, that this line was removed.",
        "source": "d2d9173e-0485-4b42-a532-2ef8baf748f1",
        "id": "9a690fd7-ec83-460e-9aa3-0285c72df51e"
    },
    {
        "references": "Voicing the Aeosian Queen is actor Lucy Lawless, making her first foray into the Star Wars galaxy after work in such franchises as Xena: Warrior Princess, Battlestar Galactica and Marvel's Agents of SHIELD.",
        "source": "d2d9173e-0485-4b42-a532-2ef8baf748f1",
        "id": "03b72b43-9b59-4447-b6b1-09fb87c1b419"
    },
    {
        "references": "Grevel's original first line to the Aeosian Queen was a very unprotocol question: \"If you're a fish, do you eat fish?\" In the finished episode, he shows a more proper royal respect.",
        "source": "155afa25-3e43-41ac-8646-deebc61827e2",
        "id": "fe7031df-de14-4256-9fab-bea23eae1e09"
    },
    {
        "references": "A significant change from an earlier iteration of this episode was that Kaz and Tam would have communicated via comlink, thus confirming each other's identity in the end battle. This was scaled back in the finished episode, with each presuming the other's identity.",
        "source": "155afa25-3e43-41ac-8646-deebc61827e2",
        "id": "d162f056-1dbe-4595-bc1d-2b9007c28eaf"
    },
    {
        "references": "In the early development of the episode, the conversation between Tierny and Tam would have opened the episode, forming the teaser before the title. Instead, Venisa's arrival forms the cold open, more clearly setting up the mission and plot of \"Rebuilding the Resistance.\"",
        "source": "d3a8450f-69ee-43b4-9d88-1cb292dfac29",
        "id": "8c545b03-046e-4b3f-804b-6108816c99e5"
    },
    {
        "references": "The original outline to the episode described Torch and Bucket's reunion as \"the two droids excitedly exchange a scomp-bump handshake and celebrate, crying oil.\" A greeting never sounded so messy!",
        "source": "d3a8450f-69ee-43b4-9d88-1cb292dfac29",
        "id": "52716ad5-7aa5-49f9-8dc9-b128b28d083b"
    },
    {
        "references": "Suite de Beyond the Awakening. Référence à un évènement de ce roman.",
        "source": "b789850d-b433-4e0c-8e6e-c0f05c4efc41",
        "id": "9206071a-7ced-46b5-aece-8c7c244b1a95"
    },
    {
        "references": "The tactical droid TJ-912 acknowledges an order by quoting a classic Battlestar Galactica line often uttered by Cylons: \"By your command.\"",
        "source": "982f1428-b1e8-4ff7-866c-8abeed4ae6ba",
        "id": "8a14a500-5c17-408f-85e6-e2c89b88aa4f"
    },
    {
        "references": "Talzin offers Dooku a rejuvenating beverage of blockroot. Fans of Willow will remember that blackroot puts hair on your chest, but you should never ever feed it to an infant.",
        "source": "f13e7c2c-96d5-425a-9954-1cac85baa30a",
        "id": "1b225a80-9e97-445f-ac7d-d6ebc55861ed"
    },
    {
        "references": "Originally planned as part of Season Seven, the Bad Batch arc began production in 2012. The episodes were fully scripted, voiced, and animated up to the \"story reel\" stage. those story reels were later released online in 2015.",
        "source": "1da910c5-73fb-4bd3-8587-7e562d62e9d3",
        "id": "70b83ab5-0f40-4776-b23e-e659b8d51619"
    },
    {
        "references": "While designs for every member of the Bad Batch had been finalized in 2011, the design team revisited the unfinished digital models in late 2018. They felt that each character's unique personality had resulted in designs for a group of soldiers that looked almost too distinct from each other, and not enough like clones. Thus, developed newly for the final season on Disney+, the remodeled Bad Batch heads are all variants of the Rex model, with features accentuated or modified. The one thing they all share is the same eyes, which are intentionnally almost identical to Rex's.",
        "source": "1da910c5-73fb-4bd3-8587-7e562d62e9d3",
        "id": "fcbcf624-d1ce-4af1-9334-c03c66172cde"
    },
    {
        "references": "Speaking of eyes, every hero character in the final season of Star Wars: The Clone Wars had been updated with smaller eyes. After several years making Rebels and Resistance, the team took the lessons they'd learned on those series and applied them to CLone Wars, bringing the characters more in line with recent productions.",
        "source": "1da910c5-73fb-4bd3-8587-7e562d62e9d3",
        "id": "5c0308f5-264f-4369-9e35-5ed43bf57983"
    },
    {
        "references": "The opening of \"A Distant Echo\" was featured in a special trailer that announced the return of The Clone Wars to an excited San Diego Comic-Con crowd in 2018.",
        "source": "f930fcfe-905c-4ae7-af59-cdd35d4e8418",
        "id": "605b1084-4bf5-49d6-85f2-39203ee4f639"
    },
    {
        "references": "This arc began production in 2020, originally planned as part of Season Six. When the episodes were revisited for the final season on Disney+, they would change greatly, including one major addition: the Martez sisters.",
        "source": "1c8b48c5-2f2c-46e2-8cbf-45f50f9d1703",
        "id": "3ee22ae3-f368-4dc8-9d21-70998b70c1fb"
    },
    {
        "references": "Rafa Martez was one of the design options for Trace that artist JP Balmet presented to executive producer Dave Filoni. The look wasn't selected for Trace, but would form the basis for the finished Rafa design.",
        "source": "1c8b48c5-2f2c-46e2-8cbf-45f50f9d1703",
        "id": "ffc69269-7c29-4f0d-890a-fc62fcaab56a"
    },
    {
        "references": "Does Pintu's voice sound familiar? That's because he's voiced by Star Wars Resistance and Saturday Night Live alum Bobby Moynihan.",
        "source": "1c8b48c5-2f2c-46e2-8cbf-45f50f9d1703",
        "id": "cda78bc4-3cd8-416c-892a-86267a2a8b7a"
    },
    {
        "references": "Candovant est nommé Cadovant",
        "source": "da864458-50ea-41a7-9958-1898c9648d89",
        "id": "86e2789d-a36a-4062-bb1b-6a294ee68111"
    },
    {
        "references": "Référence à la série Rebels",
        "source": "22d3a5c4-88b8-4080-ae71-65069b2c5066",
        "id": "a381cab8-39d0-4309-910b-21393f26129a"
    },
    {
        "references": "Référence à Doctor Aphra 30 - lorsque Nokk sauve la vie d'Aphra.",
        "source": "f647862e-8bf5-405d-8b4d-ccccd4631b3b",
        "id": "013add50-0aa5-40e3-acb8-802396691b8c"
    },
    {
        "references": "Grey utilise la phrase: \"Good Soldiers follow orders\".",
        "source": "947ac3e1-f4fe-4674-8a95-79c6f9a256db",
        "id": "0a726038-9511-4162-8c75-918aa9104bd2"
    },
    {
        "references": "Référence au roman A New Dawn - lors d'une rencontre entre Kanan et Rae Sloane.",
        "source": "afc09202-3bde-474b-9684-462c828742d6",
        "id": "e568705a-aadc-4f12-9176-fdb4580468c5"
    }
]